teleios-labs/display-firmware/firmware/sdkconfig.defaults
# ESP32-P4 target
CONFIG_IDF_TARGET="esp32p4"

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# PSRAM (required for display framebuffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y

# Cache (MIPI DSI DMA performance)
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Required for MIPI DSI
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Stack size (Slint needs headroom)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
